# language: ru

Функция: Добавления альбома
Находясь на сайте под анонимным пользователем
Логинюсь
Попадаю на форму добавления альбома
Добавляю альбом
Альбом должен сохранится в базе

Сценарий: Успешное добавление
Допустим я перехожу на страницу "/user/login"
Если я ввожу "public-user@user.com" в поле "username"
И я ввожу "user123" в поле "password"
И я нажимаю на кнопку "loginBtn"
То я вижу текст "Hello , Valera!"

И я перехожу на страницу "/addAlbum"
Если я ввожу "Test Album" в поле "name"
И я ввожу "1999" в поле "year"
И я нажимаю на кнопку "addAlbum-btn"
То я нахожусь на странице "/music"