# language: ru

Функция: Добавления артиста
Находясь на сайте под анонимным пользователем
Логинюсь
Попадаю на форму добавления артиста
Добавляю артиста
Артист должен сохранится в базе

Сценарий: Успешное добавление
Допустим я перехожу на страницу "/user/login"
Если я ввожу "public-user@user.com" в поле "username"
И я ввожу "user123" в поле "password"
И я нажимаю на кнопку "loginBtn"
То я вижу текст "Hello , Valera!"

И я перехожу на страницу "/addArtist"
Если я ввожу "Test Artist" в поле "name"
И я ввожу "Test Description" в поле "description"
И я нажимаю на кнопку "addArtist-btn"
То я нахожусь на странице "/music"