# language: ru

Функция: Добавления трека
Находясь на сайте под анонимным пользователем
Логинюсь
Попадаю на форму добавления трека
Добавляю трек
Трек должен сохранится в базе

Сценарий: Успешное добавление
Допустим я перехожу на страницу "/user/login"
Если я ввожу "public-user@user.com" в поле "username"
И я ввожу "user123" в поле "password"
И я нажимаю на кнопку "loginBtn"
То я вижу текст "Hello , Valera!"

И я перехожу на страницу "/addTrack"
Если я ввожу "Test Track" в поле "name"
И я ввожу "2003" в поле "number"
И я ввожу "2:03" в поле "duration"
И я нажимаю на кнопку "addTrack-btn"
То я нахожусь на странице "/music"