# language: ru

Функция: Добавления трека в историю треков
Находясь на сайте под анонимным пользователем
Логинюсь
Попадаю на главную страницу
Попадаю на страницу альбомов
Попадаю на страницу треков
Нажимаю на трек
Трек должен сохранится в базе

Сценарий: Успешное добавление
Допустим я перехожу на страницу "/user/login"
Если я ввожу "public-user@user.com" в поле "username"
И я ввожу "user123" в поле "password"
И я нажимаю на кнопку "loginBtn"
То я вижу текст "Hello , Valera!"

И я перехожу на страницу "/music"
Если я нажимаю на текст "Bruno"
И я нажимаю на текст "It's Better If You Don't Understand"
И я нажимаю на текст "Somewhere in Brooklyn"
И я перехожу на страницу "/trackHistory"
То я вижу текст "Somewhere in Brooklyn"